In [4]:
import pandas as pd

In [5]:
CCTV_Seoul = pd.read_csv('../data/01.CCTV_in_Seoul.csv', encoding='utf-8')
CCTV_Seoul.head()

   기관명    소계   방범용  도시공원, 놀이터  어린이 보호  쓰레기 무단투기   기타
0  강남구  3238  2076        261     443         0  458
1  강동구  1010   537         84     125        27  237
2  강북구   831   469         86     108        85   83
3  강서구   911   623         51     182        28   27
4  관악구  2109  1083        161     195        57  613

In [6]:
CCTV_Seoul.columns

Index(['기관명', '소계', '방범용', '도시공원, 놀이터', '어린이 보호', '쓰레기 무단투기', '기타'], dtype='object')

In [8]:
CCTV_Seoul.columns[0]

'기관명'

In [9]:
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0] : '구별'}, inplace=True)
CCTV_Seoul.head()

    구별    소계   방범용  도시공원, 놀이터  어린이 보호  쓰레기 무단투기   기타
0  강남구  3238  2076        261     443         0  458
1  강동구  1010   537         84     125        27  237
2  강북구   831   469         86     108        85   83
3  강서구   911   623         51     182        28   27
4  관악구  2109  1083        161     195        57  613

In [11]:
pop_Seoul = pd.read_excel('../data/01.population_in_Seoul.xls', encoding='utf-8')
pop_Seoul.head()

,기간,자치구,세대,인구,인구.1,인구.2,인구.3,인구.4,인구.5,인구.6,인구.7,인구.8,세대당인구,65세이상고령자
0,기간,자치구,세대,합계,합계,합계,한국인,한국인,한국인,등록외국인,등록외국인,등록외국인,세대당인구,65세이상고령자
1,기간,자치구,세대,계,남자,여자,계,남자,여자,계,남자,여자,세대당인구,65세이상고령자
2,2018.1/4,합계,4237610,10112070,4948481,5163589,9838892,4817507,5021385,273178,130974,142204,2.32,1382420
3,2018.1/4,종로구,73879,164348,79962,84386,154549,75749,78800,9799,4213,5586,2.09,26429
4,2018.1/4,중구,60903,135139,66582,68557,126082,62376,63706,9057,4206,4851,2.07,21655

In [13]:
pop_Seoul = pd.read_excel('../data/01.population_in_Seoul.xls', header = 2, parse_cols = 'B,D,G,J,N', encoding='utf-8')
pop_Seoul.head()

D:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: the 'parse_cols' keyword is deprecated, use 'usecols' instead
  """Entry point for launching an IPython kernel.

   자치구         계      계.1     계.2  65세이상고령자
0   합계  10112070  9838892  273178   1382420
1  종로구    164348   154549    9799     26429
2   중구    135139   126082    9057     21655
3  용산구    245411   229909   15502     37238
4  성동구    314551   306532    8019     41752

In [14]:
pop_Seoul.rename(columns={pop_Seoul.columns[0] : '구별',
                          pop_Seoul.columns[1] : '인구수',
                          pop_Seoul.columns[2] : '한국인',
                          pop_Seoul.columns[3] : '외국인',
                          pop_Seoul.columns[4] : '고령자'}, inplace=True)
pop_Seoul.head()

    구별       인구수      한국인     외국인      고령자
0   합계  10112070  9838892  273178  1382420
1  종로구    164348   154549    9799    26429
2   중구    135139   126082    9057    21655
3  용산구    245411   229909   15502    37238
4  성동구    314551   306532    8019    41752

In [15]:
import pandas as pd
import numpy as np

In [16]:
s = pd,Series([1,3,5,np.nan,6,8])

NameError: name 'Series' is not defined

In [18]:
s = pd.Series([1,3,5,np.nan,6,8])

In [19]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [20]:
dates = pd.date_range('20130101', periods=6)

In [21]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [22]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])

In [23]:
df

                   A         B         C         D
2013-01-01  0.084858  0.346125 -0.847844  1.259427
2013-01-02  0.764676  0.107136 -1.136223 -0.353701
2013-01-03  1.510187  0.416806  0.030727  0.600537
2013-01-04 -0.478088 -0.416962  1.021689 -0.502616
2013-01-05 -0.948384  0.019754 -0.209200 -0.346207
2013-01-06 -0.358162 -2.378815 -0.213764  0.593474

In [24]:
df_head(3)

NameError: name 'df_head' is not defined

In [25]:
df.head(3)

                   A         B         C         D
2013-01-01  0.084858  0.346125 -0.847844  1.259427
2013-01-02  0.764676  0.107136 -1.136223 -0.353701
2013-01-03  1.510187  0.416806  0.030727  0.600537

In [26]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [27]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [29]:
df.values

array([[ 0.08485763,  0.34612527, -0.84784377,  1.25942724],
       [ 0.76467597,  0.10713637, -1.13622265, -0.3537006 ],
       [ 1.51018748,  0.4168062 ,  0.03072703,  0.60053747],
       [-0.4780879 , -0.41696178,  1.02168943, -0.50261613],
       [-0.94838436,  0.01975391, -0.20919954, -0.34620739],
       [-0.3581621 , -2.37881458, -0.21376382,  0.59347391]])

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [31]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.095848 -0.317659 -0.225769  0.208486
std    0.902636  1.051910  0.753427  0.712152
min   -0.948384 -2.378815 -1.136223 -0.502616
25%   -0.448106 -0.307783 -0.689324 -0.351827
50%   -0.136652  0.063445 -0.211482  0.123633
75%    0.594721  0.286378 -0.029255  0.598772
max    1.510187  0.416806  1.021689  1.259427

In [32]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-03  1.510187  0.416806  0.030727  0.600537
2013-01-01  0.084858  0.346125 -0.847844  1.259427
2013-01-02  0.764676  0.107136 -1.136223 -0.353701
2013-01-05 -0.948384  0.019754 -0.209200 -0.346207
2013-01-04 -0.478088 -0.416962  1.021689 -0.502616
2013-01-06 -0.358162 -2.378815 -0.213764  0.593474